Docs/Reference/Content/images/dependencies/net8.0/mmd/alloverit-logging.mmd
flowchart LR
  alloverit-logging["AllOverIt.Logging"]
  microsoft-extensions-logging-abstractions_10-0-8["Microsoft.Extensions.Logging.Abstractions<br>v10.0.8"]
  microsoft-extensions-dependencyinjection-abstractions_10-0-8["Microsoft.Extensions.DependencyInjection.Abstractions<br>v10.0.8"]
  system-diagnostics-diagnosticsource_10-0-8["System.Diagnostics.DiagnosticSource<br>v10.0.8"]
  alloverit["AllOverIt"]
  alloverit-assertion["AllOverIt.Assertion"]
  alloverit-logging --> microsoft-extensions-logging-abstractions_10-0-8
  microsoft-extensions-logging-abstractions_10-0-8 --> microsoft-extensions-dependencyinjection-abstractions_10-0-8
  microsoft-extensions-logging-abstractions_10-0-8 --> system-diagnostics-diagnosticsource_10-0-8
  alloverit-logging --> alloverit
  alloverit --> alloverit-assertion
  style microsoft-extensions-logging-abstractions_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-dependencyinjection-abstractions_10-0-8 fill:#FFEC96,opacity:0.8
  style system-diagnostics-diagnosticsource_10-0-8 fill:#FFEC96,opacity:0.8
